Revit 2027 API
AreaLoad.IsCurveLoopsInsideHostBoundaries Method
 Checks if contour loops is inside host boundaries.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsCurveLoopsInsideHostBoundaries(
	Document doc,
	ElementId hostId,
	IList<CurveLoop> loops
)
Public Shared Function IsCurveLoopsInsideHostBoundaries (
	doc As Document,
	hostId As ElementId,
	loops As IList(Of CurveLoop)
) As Boolean
public:
static bool IsCurveLoopsInsideHostBoundaries(
	Document^ doc,
	ElementId^ hostId,
	IList<CurveLoop^>^ loops
)
static member IsCurveLoopsInsideHostBoundaries :
        doc : Document *
        hostId : ElementId *
        loops : IList<CurveLoop> -> bool
Parameters
doc Document
 Document.
hostId ElementId
 The id of the analytical element that is about to host a load
loops IList<CurveLoop>
 CurveLoops to be checked.
Return Value
Boolean
 Returns true if area load is positioned with entire distribution over the host, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace